rogalmic.bash-debug
aaron-bond.better-comments
jeff-hykin.better-cpp-syntax
jeff-hykin.better-dockerfile-syntax
jeff-hykin.better-shellscript-syntax
josetr.cmake-language-support-vscode
ms-vscode.cmake-tools
formulahendry.code-runner
streetsidesoftware.code-spell-checker
github.codespaces
github.copilot
github.remotehub
github.vscode-pull-request-github
github.vscode-github-actions
ms-vscode.vscode-github-issue-notebooks
ms-vscode.cpptools
editorconfig.editorconfig
kaiwood.endwise
swyddfa.esbonio
tamasfe.even-better-toml
grapecity.gc-excelviewer
mhutchie.git-graph
donjayamanne.githistory
codezombiech.gitignore
eamodio.gitlens
golang.go
ms-vscode.hexeditor
oderwat.indent-rainbow
k--kato.intellij-idea-keybindings
james-yu.latex-workshop
tecosaur.latex-utilities
ritwickdey.liveserver
xyz.local-history
ms-vscode.makefile-tools
yzhang.markdown-all-in-one
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
pkief.material-icon-theme
christian-kohler.npm-intellisense
nvidia.nsight-vscode-edition
ryu1kn.partial-diff
christian-kohler.path-intellisense
ms-vscode.powershell
esbenp.prettier-vscode
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.pylint
charliermarsh.ruff
ms-python.mypy-type-checker
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-toolsai.python-ds-extension-pack
ms-toolsai.datawrangler
ms-toolsai.tensorboard
mechatroner.rainbow-csv
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode-remote.remote-containers
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
lextudio.restructuredtext
shopify.ruby-lsp
rust-lang.rust-analyzer
alefragnani.separators
natizyskunk.sftp
foxundermoon.shell-format
timonwong.shellcheck
trond-snekvik.simple-rst
gruntfuggly.todo-tree
bazelbuild.vscode-bazel
mitaki28.vscode-clang
llvm-vs-code-extensions.vscode-clangd
llvm-vs-code-extensions.vscode-mlir
ms-azuretools.vscode-containers
ms-dotnettools.vscode-dotnet-runtime
hediet.vscode-drawio
janisdd.vscode-edit-csv
dbaeumer.vscode-eslint
ms-kubernetes-tools.vscode-kubernetes-tools
ms-ceintl.vscode-language-pack-zh-hans
vadimcn.vscode-lldb
davidanson.vscode-markdownlint
ms-vscode.vscode-typescript-next
redhat.vscode-yaml
ms-vsliveshare.vsliveshare
dotjoshjohnson.xml
