ms-vscode.azure-account
rogalmic.bash-debug
aaron-bond.better-comments
jeff-hykin.better-cpp-syntax
jeff-hykin.better-dockerfile-syntax
jeff-hykin.better-shellscript-syntax
twxs.cmake
josetr.cmake-language-support-vscode
ms-vscode.cmake-tools
formulahendry.code-runner
streetsidesoftware.code-spell-checker
GitHub.codespaces
GitHub.copilot
GitHub.copilot-chat
GitHub.vscode-pull-request-github
github.vscode-github-actions
ms-vscode.cpptools
EditorConfig.EditorConfig
kaiwood.endwise
tamasfe.even-better-toml
GrapeCity.gc-excelviewer
mhutchie.git-graph
donjayamanne.githistory
codezombiech.gitignore
eamodio.gitlens
golang.go
znck.grammarly
k--kato.intellij-idea-keybindings
redhat.java
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
julialang.language-julia
James-Yu.latex-workshop
tecosaur.latex-utilities
ritwickdey.LiveServer
xyz.local-history
ms-vscode.makefile-tools
yzhang.markdown-all-in-one
PKief.material-icon-theme
Gimly81.matlab
AffenWiesel.matlab-formatter
ms-mssql.mssql
christian-kohler.npm-intellisense
ryu1kn.partial-diff
christian-kohler.path-intellisense
jebbs.plantuml
mxschmitt.postscript
ms-vscode.powershell
esbenp.prettier-vscode
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.pylint
charliermarsh.ruff
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
mechatroner.rainbow-csv
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode-remote.remote-containers
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
GitHub.remotehub
lextudio.restructuredtext
stkb.rewrap
Shopify.ruby-lsp
rust-lang.rust-analyzer
alefragnani.separators
Natizyskunk.sftp
foxundermoon.shell-format
timonwong.shellcheck
trond-snekvik.simple-rst
TabNine.tabnine-vscode
Gruntfuggly.todo-tree
octref.vetur
dunstontc.viml
BazelBuild.vscode-bazel
mitaki28.vscode-clang
llvm-vs-code-extensions.vscode-clangd
llvm-vs-code-extensions.vscode-mlir
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
hediet.vscode-drawio
janisdd.vscode-edit-csv
dbaeumer.vscode-eslint
joaompinto.vscode-graphviz
vscode-icons-team.vscode-icons
vscjava.vscode-java-pack
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-maven
ms-kubernetes-tools.vscode-kubernetes-tools
MS-CEINTL.vscode-language-pack-zh-hans
DavidAnson.vscode-markdownlint
formulahendry.vscode-mysql
ms-vscode.vscode-typescript-next
redhat.vscode-yaml
VisualStudioExptTeam.vscodeintellicode
ms-vsliveshare.vsliveshare
DotJoshJohnson.xml
