brew "gcc"
brew "llvm"
brew "openssl@3"
brew "atool"
brew "bat"
brew "btop"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "diff-so-fancy"
brew "diffutils"
brew "duf"
brew "fd"
brew "file-formula"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "go"
brew "highlight"
brew "htop"
brew "jq"
brew "mypy"
brew "ninja"
brew "pipx"
brew "pre-commit"
brew "python@3"
brew "ranger"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "uv"
